In [7]:
import pandas as pd
import numpy as np

In [9]:
dict1={'Name':['Ramesh','Suresh', 'Satish', np.nan],
       'Age': [ 30,33,np.nan,36],
       'City': [np.nan, 'Hyd', 'Hyd', 'blr']}

In [11]:
data=pd.DataFrame(dict1)
data

     Name   Age City
0  Ramesh  30.0  NaN
1  Suresh  33.0  Hyd
2  Satish   NaN  Hyd
3     NaN  36.0  blr

In [13]:
data.to_csv('file.csv',index=False)

In [15]:
data.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

## dropna

- drop the null values data based on rows and columns

In [18]:
data.dropna()

     Name   Age City
1  Suresh  33.0  Hyd

In [20]:
data

     Name   Age City
0  Ramesh  30.0  NaN
1  Suresh  33.0  Hyd
2  Satish   NaN  Hyd
3     NaN  36.0  blr

In [22]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [24]:
dict1 = {
    'Name': ['Ramesh', 'Suresh', 'Satish', np.nan],
    'Age': [30, 33, np.nan, 36],
    'City': [np.nan, 'Hyd', 'Hyd', 'blr'],
    'Company': ['Google', 'Microsoft', 'Apple', 'Meta']
}
data1=pd.DataFrame(dict1)
data1

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish   NaN  Hyd      Apple
3     NaN  36.0  blr       Meta

In [26]:
data1.dropna(axis=1)

     Company
0     Google
1  Microsoft
2      Apple
3       Meta

In [28]:
data1.fillna(30)

     Name   Age City    Company
0  Ramesh  30.0   30     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  30.0  Hyd      Apple
3      30  36.0  blr       Meta

In [30]:
data1['Name'].fillna('Manish')

0    Ramesh
1    Suresh
2    Satish
3    Manish
Name: Name, dtype: object

In [32]:
data1['City'].fillna('chennai')

0    chennai
1        Hyd
2        Hyd
3        blr
Name: City, dtype: object

In [34]:
data1

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish   NaN  Hyd      Apple
3     NaN  36.0  blr       Meta

### Drawback : Filling with Random value is not a good approach

- Below are useful methods to fill the data
    -     backfill
    -   bfill
    -  ffill
    -   pad

Note : 
- pad = ffill(both functions are same)
- backfill = bfill

In [37]:
data1

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish   NaN  Hyd      Apple
3     NaN  36.0  blr       Meta

In [39]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='backfill')

     Name   Age City    Company
0  Ramesh  30.0  Hyd     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  36.0  Hyd      Apple
3     NaN  36.0  blr       Meta

In [41]:
data1.fillna(method='bfill')

     Name   Age City    Company
0  Ramesh  30.0  Hyd     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  36.0  Hyd      Apple
3     NaN  36.0  blr       Meta

In [43]:
data1.fillna(method='ffill')

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  33.0  Hyd      Apple
3  Satish  36.0  blr       Meta

In [45]:
data1.fillna(method='pad')

     Name   Age City    Company
0  Ramesh  30.0  NaN     Google
1  Suresh  33.0  Hyd  Microsoft
2  Satish  33.0  Hyd      Apple
3  Satish  36.0  blr       Meta

## Mean - Meadian - Mode

- In data frame Numerical columns will be replaced with Mean or Median

- if ther are outliers then Mean will be impacted
- if outliers are present replace with Median

- Categorical column should be replaced with Mode

In [49]:
np.mean(data1['Age'])

33.0

In [51]:
mean_age = data1['Age'].mean()
print('mean_age:', mean_age)
data1['Age'].fillna(mean_age)

mean_age: 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [53]:
city_mode=data['City'].mode()
city_mode

0    Hyd
Name: City, dtype: object

In [55]:
city_mode[0]

'Hyd'

## impute class

    - under sklearn we have impute class

In [58]:
from sklearn import impute

In [60]:
dir(impute)

['KNNImputer',
 'MissingIndicator',
 'SimpleImputer',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__file__',
 '__getattr__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '_base',
 '_knn',
 'typing']

## KNNImputer

In [63]:
import numpy as np
from sklearn.impute import KNNImputer
x=[[1,2,np.nan], [3,np.nan,3], [np.nan,60,5], [8,8,7]]
print(x)
imputer=KNNImputer(n_neighbors=2,weights='uniform')
imputer.fit_transform(x)

[[1, 2, nan], [3, nan, 3], [nan, 60, 5], [8, 8, 7]]

array([[ 1. ,  2. ,  5. ],
       [ 3. , 31. ,  3. ],
       [ 5.5, 60. ,  5. ],
       [ 8. ,  8. ,  7. ]])

In [65]:
import numpy as np
from sklearn.impute import KNNImputer
x=[[1,2,np.nan], [3,np.nan,3], [np.nan,60,5], [8,8,7]]
print(x)
imputer=KNNImputer(n_neighbors=2,weights='distance')
imputer.fit_transform(x)

[[1, 2, nan], [3, nan, 3], [nan, 60, 5], [8, 8, 7]]

array([[ 1.        ,  2.        ,  3.93905505],
       [ 3.        , 31.        ,  3.        ],
       [ 3.25775362, 60.        ,  5.        ],
       [ 8.        ,  8.        ,  7.        ]])